//SIMONCO JOB (1),'BLANK JCL',CLASS=A,MSGCLASS=A
//COBOL  EXEC PROC=COB2UCG,SYSOUT='*'
//SYSIN   DD *
   *** COBOL CODE GOES HERE ***
/*
//GO.INPUT DD *
 *** INPUT RECORDS GO HERE ***
/*
//GO.OUTPUT DD SYSOUT=*,
//             DCB=(RECFM=FBA,LRECL=132,BLKSIZE=13200)
//