//SIMONCO  JOB (1),'COBOL EXAMPLE',CLAS=A,MSGCLASS=A
//COBOL   EXEC COB2UCG,SYSOUT=*
//SYSIN    DD *

/*
GO.INPUT   DD *

/*
//GO.OUTPUT  DD SYSOUT=*,
//              DCB=(RECFM=FBA,LRECL=132,BLKSIZE=13200)
//